; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Peter Ћilбk alias zilabo <peter.zilak@gmail.com>
; 
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Skonиiќ"
MAIN_DEST_DIR_LABEL = "&Cieѕovэ adresбr:"
MAIN_FILE_LABEL = "&Archнv/Inљtalбtor na rozbalenie:"
MENU_FILE_LABEL = "&Sъbor"
MENU_FILE_QUIT_LABEL = "&Skonиiќ"
MENU_EDIT_LABEL = "&Upraviќ"
MENU_EDIT_PREFS_LABEL = "&Nastavenia"
MENU_HELP_LABEL = "&Pomoc"
MENU_HELP_WEB_LABEL = "%s &Domovskб strбnka"
PREFS_TITLE_LABEL = "Nastavenia"
PREFS_UNIEXTRACT_OPTS_LABEL = "Moћnosti Universal Extractor"
PREFS_HISTORY_LABEL = "Zapisovaќ histуriu &archнvov"
PREFS_FORMAT_OPTS_LABEL = "Moћnosti љpecifikбcie formбtu"
PREFS_LANG_LABEL = "&Jazyk"
PREFS_DEBUG_LABEL = "&Adresбr Debug sъboru:"
PREFS_WARN_EXECUTE_LABEL = "&Upozorniќ pred spustenнm sъborov"
PREFS_REMOVE_DUPE_LABEL = "&Odstrбniќ duplicitnй sъbory"
PREFS_REMOVE_TEMP_LABEL = "Odstrбniќ &doиasnй sъbory"
PREFS_APPEND_EXT_LABEL = "&Doplniќ chэbajъce prнpony sъborov"
METHOD_ADMIN_RADIO = "%s Administrбtorskэ inљtalбtor"
METHOD_EXTRACTION_RADIO = "%s rozbalenie"
METHOD_HEADER = "%s Rozbalenie"
METHOD_MSI_NOTE_LABEL = "Note:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml vyћaduje"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Metуda rozbalenia"
METHOD_SWITCH_RADIO = "%s switch"
METHOD_NOTIS_RADIO = "Nie je InstallShield inљtalбtor"
METHOD_TEXT_LABEL = "%s podporuje nasledovnй metуdy na rozbalenie %s balнkov.  Ћiaѕ, ani jedna z tэchto metуd nie je 100%  Ak sa zdб, ћe prednastavenб metуda nepracuje, prosнm vrбќte sa a vyberte alternatнvnu metуdu."
METHOD_UNPACKER_RADIO = "%s Rozbaѕovaи"

; GUI control functions
DOES_NOT_EXIST = "neexistuje.%n"
EXTRACT_TO = "Rozbaliќ do"
INVALID_DIR_SELECTED =  "%s nie je platnэ adresбr."
INVALID_FILE_SELECTED = "%sProsнm vyberte platnэ sъbor."
OPEN_FILE = "Otvoriќ sъbor"
SELECT_FILE = "Vybraќ sъbor"
WRITE_TO = "Zapнsaќ do"

; Common terms
TERM_ARCHIVE = "archнv"
TERM_COMPRESSED = "skomprimovanэ sъbor"
TERM_DISK = "disk"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "odkуdovanэ sъbor"
TERM_EXECUTABLE = "spustiteѕnэ"
TERM_FAILED = "zlyhala"
TERM_HELP = "Sъbor pomocnнka"
TERM_HOTFIX = "zбplata"
TERM_IMAGE = "obraz"
TERM_INSTALLER = "inљtalбtor"
TERM_PACKAGE = "balнk"
TERM_PATCH = "zбplata"
TERM_SFX = "Samorozbaѕovacн"
TERM_STAGE = "Stupeт"
TERM_SUCCEEDED = "ъspeљnб"
TERM_TESTING = "Testovanie"
TERM_UNKNOWN = "neznбmy"
TERM_UNPACKED = "rozbalenэ"
TERM_UPDATER = "aktualizaиnэ program"

; Status messages
SCANNING_FILE = "Skenovanie sъboru na zistenie typu sъboru."
SCANNING_EXE = "Skenovanie sъboru s %s scan."
EXTRACTING = "Rozbaѕovanie sъborov z:"
INIT_WAIT = "Иakanie na inicializбciu inљtalбtora.%nProsнm иakajte."

; Custom prompts
CONVERT_CDROM = "%s CD-ROM obrazy nemфћu byќ rozbalenй priamo. Namiesto toho, tento%obraz bude konvertovanэ na ISO CD-ROM obraz, ktorэ bude potom rozbalenэ.       Chcete pokraиovaќ?%nPozor: Tбto operбcia zaberie niekoѕko minъt."
CONVERT_CDROM_STAGE1_FAILED = "Chyba:  CD-ROM obraz nemфћe byќ konvertovanэ.%nAk je toto BIN/CUE obraz, uistite sa, ћe CUE sъbor je sprбvne naformбtovanэ."
CONVERT_CDROM_STAGE2_FAILED = "Chyba:  ISO obraz bol vytvorenэ z %s obrazu, ale nemфћe byќ konvertovanэ.%nChcete ponechaќ ISO obraz pre пalљiu analэzu?"
CONVERT_BIN_MISSING = "Chyba: Nemoћno nбjsќ:%n%s\%s.%s%n%nObidba %s.bin aj %s.cue sъ potrebnй."
INIT_COMPLETE = "Inicializбcia %s.  Prosнm ukonиite inљtalбtor, potom kliknite OK na pokraиovanie."
WISE_MSI_PROMPT = "Pozor:  Tбto metуda pracuje len so љpecifickэmi Wise inљtalaиnэmi balнkmi pre Windows.%nAk Wise Inљtalaиnэ Wizard zaинna a иakб na vstup, tento sъbor nie je %npodporovanэ.  Prosнm ukonиite inљtalбtor, a %s ukonин rozbaѕovanie.%n%nChcete pokraиovaќ?"
UNPACK_PROMPT = "Tento sъbor je zbalenэ s %s kompresiou, ale mфћe byќ rozbalenэ.%nJe to preto, lebo typ sъboru je nepodporovanэ, alebo%n"neobsahuje ћiadne sъbory na rozbalenie.%n%nChcete aj tak rozbaliќ tento sъbor?%n%nPozor: Rozbalenэ sъbor bude pomenovanэ:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Chyba: %s%nnemфћe byќ rozbalenэ."
WARN_EXECUTE = "Varovanie:  Na rozbalenie sъborov tohto typu, musн byќ tento sъbor priamo spustenэ.%nAk budete pokraиovaќ, spustн sa nasledovnэ prнkaz:%n%n%s%n%nAk verнte, ћe tento sъbor by mohol byќ zбkernэ, odporъиa sa nepokraиovaќ.%nChcete pokraиovaќ s rozbaѕovanнm?"

; Help text
HELP_SUMMARY = "Rozbalн sъbory z akйhokoѕvek archнvu alebo inљtalaиnйho balнka."
HELP_SYNTAX = "%nPouћitie:  %s [/help] [menosъboru [umiestnenie]]"
HELP_ARGUMENTS = "%n%nPodporovanй argumenty:"
HELP_HELP = "%n     /help%t%tZobraziќ tъto pomocnъ informбciu"
HELP_FILENAME = "%n     menosъboru%tMeno sъboru na rozbalenie"
HELP_DESTINATION = "%n     umiestnenie%tAdresбr, do ktorйho rozbaliќ"
HELP_SUB = "%n%nPassing /sub instead of a destination directory name instructs%n%s to extract to subdirectory named after the archive."
HELP_EXAMPLE1 = "%n%nPrнklad:"
HELP_EXAMPLE2 = "%n     %s c:\1\prнklad.zip c:\test"
HELP_NOARGS = "%n%nSpustenie %s bez argumentov%nvyzve uћнvateѕa na zadanie nбzvu sъboru a cieѕovйho adresбra.

; Error messages
CANNOT_LOG = "%s rozbalenie nemфћe byќ zapнsanй."
CANNOT_DEBUG = "Adresбr umietnenia debug sъboru, "%s", nie je zapisovateѕnэ.%nNamiesto toho bude pouћitэ vбљ doиasnэ adresбr."
CANNOT_EXTRACT = "%s nemфћe byќ rozbalenэ.%nTyp vrбtenйho sъboru: %s%n%nKliknite OK ak chcete analyzovaќ sъbor, alebo Zruљiќ na skonиenie."
UNKNOWN_EXT = "%s%nmб neznбmu prнponu alebo nemфћe byќ rozbalenэ."
INVALID_DIR = "%s%nnie je moћnй vytvoriќ. Prosнm vyberte sprбvne umiestnenie."
EXTRACT_FAILED = "%s nemфћe byќ rozbalenэ.%nVypadб, ћe to je(n) %s, ktorэ je podporovanэ, ale rozbalenie zlyhalo.%nProsнm pozrite log sъbor, %s, pre viac informбciн.%n%nKliknite OK na prezretie log sъboru teraz, alebo Zruљiќ na skonиenie."

[Installer]
; Components page
COMP_DOCS = "Documentбcia a licenиnй informбcie"
COMP_LANG = "Jazykovй sъbory pre medzinбrodnъ podporu"
COMP_ACE = "Podpora pre ACE sъbory"
COMP_KGB = "Podpora pre KGB sъbory"
COMP_PEA = "Podpora pre Pea sъbory"
COMP_SIT = "Podpora pre StuffIt sъbory"

; Preferences page
PREFS_CAPTION = "Nastavte moћnosti programu"
PREFS_DESCRIPTION = "Ktorй Universal Extractor moћnosti chcete nastaviќ?"
PREFS_LABEL1 = "Moћete nastaviќ nasledovnй moћnosti na prispфsobenie prednastavenйho chovania Universal Extractor."
PREFS_LABEL2 = "Tieto moћnosti mфћu byќ zmenenй po inљtalбcii modifikovanнm UniExtract.ini."
LANGUAGE_LABEL = "Prednastavenэ jazyk"
DEBUG_LABEL = "Umiestnenie Debug sъboru"
APPEND_EXT_LABEL = "&Doplniќ chэbajъce prнpony sъborov"
HISTORY_LABEL = "&Zapisovaќ histуriu archнvov"
REMOVE_DUPE_LABEL = "Odstrбniќ &duplicitnй sъbory"
REMOVE_TEMP_LABEL = "Odstrбniќ &doиasnй sъbory"
WARN_EXECUTE_LABEL = "&Upozorniќ pred spustenнm sъborov"

; Tasks page
ASSOCIATE = "&Povoliќ integrбciu do kontextovйho menu Explorera"
ASSOCIATE_FILES = "Pridaќ UniExtract &sъbory... do kontextovйho menu"
ASSOCIATE_HERE = "Pridaќ UniExtract &sem do kontextovйho menu"
ASSOCIATE_SUBDIR = "Pridaќ UniExtract do &subadresбra do kontextovйho menu"
ASSOCIATE_FORCE = "Vynъtiќ &associбciu so vљetkэmi podporovanэmi formбtmi archнvov"
MODIFY_PATH = "Pridaќ Universal Extractor do systйmovej &cesty"
DESKTOP_ICON = "Vytvoriќ &ikonu na ploche"
QUICK_LAUNCH_ICON = "Vytvoriќ &ikonu v paneli Rэchleho spustenia"
SENDTO_ICON = "Vytvoriќ Odoslaќ&kam ikonu"

; Context Menu integration
EXTRACT_FILES = "UniExtract &sъbory..."
EXTRACT_HERE = "UniExtract &sem"
EXTRACT_SUB = "UniExtract do &subadresбra"
